app/channels/sala_channel.rb

INSERT INTO "messages" ("texto", "user_id", "sala_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["texto", "Bem vindo igor"], ["user_id", 1], ["sala_id", 1], ["created_at", "2018-09-11 13:34:30.329191"], ["updated_at", "2018-09-11 13:34:30.329191"]]
---
  def speak (data)
  #Message.create!(texto: data['message'], user_id: data['current_user'], sala_id: data[':sala_id'])
  #Message.create!(user_id: current_user, sala_id: params['sala_id'], texto: data['message'])
  current_user.messages.create!(texto: data['message'], sala_id: params[:sala_id])