app/controllers/salas_controller.rb

  def show
    #@messages = Message.all
    @messages = Message.page(params[:page]).per(10).order(created_at: :asc)
    #@message_user = current_user.id
    #@message_sala = @sala.id
    #@sala = Sala.includes(:messages).find_by(id: params[:id])
    #@message = Message.new
    #@messages = Sala.includes(:messages).find_by(id: params[:sala_id])
    #@messages = Message.page(params[:page]).per(10).order(created_at: :asc)
    @participantes = @sala.participantes.build
    @new_solicitation = @sala.solicitations.build
    @solicitations = Solicitation.all
---
SELECT  "messages".* FROM "messages" ORDER BY "messages"."created_at" ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "messages"
SELECT "solicitations".* FROM "solicitations" WHERE "solicitations"."sala_id" = ? AND "sala_solicitation"."id" IS NOT NULL  [["sala_id", 1]]

  def create
    #@sala = current_user.salas.build(sala_params)
    @sala = Sala.new(sala_params)
    #@sala.build_adm
    #@adm = Adm.new(adm_params)
    #@adm = Adm.new(params[:adm])
    #@sala.adm_id = current_user.id  # Preenchendo o campo com o id

    respond_to do |format|
      if @sala.save
---
INSERT INTO "salas" ("nome", "descricao", "adm_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Ruby"], ["descricao", "Desenvolvedores Ruby On Rails."], ["adm_id", 1], ["created_at", "2018-09-11 20:30:05.782510"], ["updated_at", "2018-09-11 20:30:05.782510"]]

    def set_sala
      @sala = Sala.find(params[:id])
---
SELECT  "salas".* FROM "salas" WHERE "salas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]