app/controllers/solicitations_controller.rb

  def index
    @solicitations = Solicitation.all
---
SELECT "solicitations".* FROM "solicitations"

  def new
    @sala = Sala.find(params[:sala_id])
---
SELECT  "salas".* FROM "salas" WHERE "salas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @salas = Sala.all
    @solicitation = Solicitation.new(solicitation_params)
    #@sala = Sala.find.(params[:sala_id])

    respond_to do |format|
      if @solicitation.save
---
INSERT INTO "solicitations" ("user_id", "sala_id", "texto", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["sala_id", 1], ["texto", "De novo"], ["created_at", "2018-09-11 20:42:22.098452"], ["updated_at", "2018-09-11 20:42:22.098452"]]

  def update
    respond_to do |format|
      if @solicitation.update(solicitation_params)
---
UPDATE "solicitations" SET "user_id" = ?, "concluida" = ?, "updated_at" = ? WHERE "solicitations"."id" = ?  [["user_id", 1], ["concluida", 1], ["updated_at", "2018-09-11 21:47:24.298215"], ["id", 1]]

  def destroy
    @solicitation.destroy
---
DELETE FROM "solicitations" WHERE "solicitations"."id" = ?  [["id", 2]]

    def set_solicitation
      @solicitation = Solicitation.find(params[:id])
---
SELECT  "solicitations".* FROM "solicitations" WHERE "solicitations"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]