app/models/solicitation.rb

  def user_nome
	if self.user.blank?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]