app/views/salas/_participante_fields.html.erb

    <%= f.label :user_id %>
    <%= f.collection_select :user_id, User.order(:nome), :id, :nome, prompt: 'Selecione' %>
---
SELECT "users".* FROM "users" ORDER BY "users"."nome" ASC