app/views/salas/show.html.erb

<% @usuario = current_user.id %><br>
<% if ((@sala.adm.user.id == current_user.id) && @sala.users.include?(current_user)) == true %>
---
SELECT  "adms".* FROM "adms" WHERE "adms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "participantes" ON "users"."id" = "participantes"."user_id" WHERE "participantes"."sala_id" = ? AND "users"."id" = ? LIMIT ?  [["sala_id", 1], ["id", 1], ["LIMIT", 1]]

  <div id="users">
    <% @sala.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "participantes" ON "users"."id" = "participantes"."user_id" WHERE "participantes"."sala_id" = ?  [["sala_id", 1]]

 <h3> Solicitações: </h3>
 <% @sala.solicitations.where(concluida: false).each do |solicitation| %>
---
SELECT "solicitations".* FROM "solicitations" WHERE "solicitations"."sala_id" = ? AND "solicitations"."concluida" = ?  [["sala_id", 2], ["concluida", 0]]


<% elsif @sala.users.include?(current_user) == true %>
---
SELECT "users".* FROM "users" INNER JOIN "participantes" ON "users"."id" = "participantes"."user_id" WHERE "participantes"."sala_id" = ?  [["sala_id", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "participantes" ON "users"."id" = "participantes"."user_id" WHERE "participantes"."sala_id" = ? AND "users"."id" = ? LIMIT ?  [["sala_id", 2], ["id", 1], ["LIMIT", 1]]

  <div id="users">
    <% @sala.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "participantes" ON "users"."id" = "participantes"."user_id" WHERE "participantes"."sala_id" = ?  [["sala_id", 2]]